Revit 2024 API
LabelUtils.GetLabelForSymbol Method
 Gets the user-visible name for a symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static string GetLabelForSymbol(
	ForgeTypeId symbolTypeId
)
Visual Basic
Public Shared Function GetLabelForSymbol ( _
	symbolTypeId As ForgeTypeId _
) As String
Visual C++
public:
static String^ GetLabelForSymbol(
	ForgeTypeId^ symbolTypeId
)
Parameters
symbolTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the symbol to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Symbol must have a definition.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace